app/controllers/cars_controller.rb

  def edit
    @car = current_user.cars.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 AND "cars"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @car = current_user.cars.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("name", "model", "year", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Camry"], ["model", "standard"], ["year", "2019"], ["user_id", 1], ["created_at", "2019-12-18 22:10:24.568537"], ["updated_at", "2019-12-18 22:10:24.568537"]]

  def update
    @car = current_user.cars.find(params[:id])

    respond_to do |format|
      if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 AND "cars"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "year" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["year", "2018"], ["updated_at", "2019-12-18 22:10:42.025964"], ["id", 1]]